In [1]:
import pandas as pd
import numpy as np
import seaborn as sns

Görev 1: Seaborn kütüphanesi içerisinden Titanic veri setini tanımlayınız.

In [2]:
titanic = sns.load_dataset('titanic')
df = titanic.copy()
df.head()
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 15 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   survived     891 non-null    int64
 1   pclass       891 non-null    int64
 2   sex          891 non-null    object
 3   age          714 non-null    float64
 4   sibsp        891 non-null    int64
 5   parch        891 non-null    int64
 6   fare         891 non-null    float64
 7   embarked     889 non-null    object
 8   class        891 non-null    category
 9   who          891 non-null    object
 10  adult_male   891 non-null    bool
 11  deck         203 non-null    category
 12  embark_town  889 non-null    object
 13  alive        891 non-null    object
 14  alone        891 non-null    bool
dtypes: bool(2), category(2), float64(2), int64(4), object(5)
memory usage: 80.7+ KB

Görev 2: Titanic veri setindeki kadın ve erkek yolcuların sayısını bulunuz.

In [3]:
df["sex"].value_counts()

sex
male      577
female    314
Name: count, dtype: int64

Görev 3: Her bir sutuna ait unique değerlerin sayısını bulunuz.

In [4]:
df.nunique()

survived         2
pclass           3
sex              2
age             88
sibsp            7
parch            7
fare           248
embarked         3
class            3
who              3
adult_male       2
deck             7
embark_town      3
alive            2
alone            2
dtype: int64

Görev 4: pclass değişkeninin unique değerlerinin sayısını bulunuz.

In [5]:
df["pclass"].nunique()

3

Görev 5: pclass ve parch değişkenlerinin unique değerlerinin sayısını bulunuz.

In [6]:
df[["pclass","parch"]].nunique()

pclass    3
parch     7
dtype: int64

Görev 6: embarked değişkeninin tipini kontrol ediniz. Tipini category olarak değiştiriniz ve tekrar kontrol ediniz.

In [7]:
df["embarked"].dtype # object
df["embarked"] = df["embarked"].astype("category")
df["embarked"].dtype # category

CategoricalDtype(categories=['C', 'Q', 'S'], ordered=False)

Görev 7: embarked değeri C olanların tüm bilgilerini gösteriniz.

In [8]:
df.loc[df["embarked"] == "C" , :].count()

survived       168
pclass         168
sex            168
age            130
sibsp          168
parch          168
fare           168
embarked       168
class          168
who            168
adult_male     168
deck            69
embark_town    168
alive          168
alone          168
dtype: int64

Görev 8: embarked değeri S olmayanların tüm bilgelerini gösteriniz.

In [9]:
df.loc[df["embarked"] != "S" , :].count()

survived       247
pclass         247
sex            247
age            160
sibsp          247
parch          247
fare           247
embarked       245
class          247
who            247
adult_male     247
deck            75
embark_town    245
alive          247
alone          247
dtype: int64

Görev 9: Yaşı 30 dan küçük ve kadın olan yolcuların tüm bilgilerini gösteriniz.

In [10]:
df.query("age < 30 and sex == 'female' ")

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
2,1,3,female,26.0,0,0,7.9250,S,Third,woman,False,NaN,Southampton,yes,True
8,1,3,female,27.0,0,2,11.1333,S,Third,woman,False,NaN,Southampton,yes,False
9,1,2,female,14.0,1,0,30.0708,C,Second,child,False,NaN,Cherbourg,yes,False
10,1,3,female,4.0,1,1,16.7000,S,Third,child,False,G,Southampton,yes,False
14,0,3,female,14.0,0,0,7.8542,S,Third,child,False,NaN,Southampton,no,True
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
874,1,2,female,28.0,1,0,24.0000,C,Second,woman,False,NaN,Cherbourg,yes,False
875,1,3,female,15.0,0,0,7.2250,C,Third,child,False,NaN,Cherbourg,yes,True
880,1,2,female,25.0,0,1,26.0000,S,Second,woman,False,NaN,Southampton,yes,False
882,0,3,female,22.0,0,0,10.5167,S,Third,woman,False,NaN,Southampton,no,True
887,1,1,female,19.0,0,0,30.0000,S,First,woman,False,B,Southampton,yes,True

Görev 10: Fare'i 500'den büyük veya yaşı 70 den büyük yolcuların bilgilerini gösteriniz.

In [11]:
df[(df["fare"] > 500 ) & (df["age"] > 70 )]

Empty DataFrame
Columns: [survived, pclass, sex, age, sibsp, parch, fare, embarked, class, who, adult_male, deck, embark_town, alive, alone]
Index: []

Görev 11: Her bir değişkendeki boş değerlerin toplamını bulunuz.

In [12]:
df.query("fare > 500 or age > 70  ")

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
96,0,1,male,71.0,0,0,34.6542,C,First,man,True,A,Cherbourg,no,True
116,0,3,male,70.5,0,0,7.7500,Q,Third,man,True,NaN,Queenstown,no,True
258,1,1,female,35.0,0,0,512.3292,C,First,woman,False,NaN,Cherbourg,yes,True
493,0,1,male,71.0,0,0,49.5042,C,First,man,True,NaN,Cherbourg,no,True
630,1,1,male,80.0,0,0,30.0000,S,First,man,True,A,Southampton,yes,True
679,1,1,male,36.0,0,1,512.3292,C,First,man,True,B,Cherbourg,yes,False
737,1,1,male,35.0,0,0,512.3292,C,First,man,True,B,Cherbourg,yes,True
851,0,3,male,74.0,0,0,7.7750,S,Third,man,True,NaN,Southampton,no,True

Görev 12: who değişkenini dataframe’den çıkarınız.

In [13]:
df.isnull().sum()

survived         0
pclass           0
sex              0
age            177
sibsp            0
parch            0
fare             0
embarked         2
class            0
who              0
adult_male       0
deck           688
embark_town      2
alive            0
alone            0
dtype: int64

Görev 13: deck değikenindeki boş değerleri deck değişkenin en çok tekrar eden değeri (mode) ile doldurunuz.

In [14]:
df.drop("who", axis=1, inplace=True)

Görev 14: age değikenindeki boş değerleri age değişkenin medyanı ile doldurunuz.

In [15]:
df["deck"].fillna(df["deck"].mode()[0], inplace=True)

Görev 15: survived değişkeninin pclass ve cinsiyet değişkenleri kırılımınında sum, count, mean değerlerini bulunuz.

In [16]:
df["age"].fillna(df["age"].median(), inplace=True)

Görev 16: 30 yaşın altında olanlar 1, 30'a eşit ve üstünde olanlara 0 vericek bir fonksiyon yazın.
Yazdığınız fonksiyonu kullanarak titanik veri setinde age_flag adında bir değişken oluşturunuz oluşturunuz. (apply ve lambda yapılarını kullanınız)

In [17]:
df.groupby(["pclass","sex"])["survived"].agg(["sum", "count", "mean"])
df["age_flag"] = df["age"].apply(lambda x: 1 if x >= 30 else 0)

Görev 17: Seaborn kütüphanesi içerisinden Tips veri setini tanımlayınız.

In [18]:
df = sns.load_dataset("tips")
df.head()

   total_bill   tip     sex smoker  day    time  size
0       16.99  1.01  Female     No  Sun  Dinner     2
1       10.34  1.66    Male     No  Sun  Dinner     3
2       21.01  3.50    Male     No  Sun  Dinner     3
3       23.68  3.31    Male     No  Sun  Dinner     2
4       24.59  3.61  Female     No  Sun  Dinner     4

Görev 18: Time değişkeninin kategorilerine (Dinner, Lunch) göre total_bill değerlerinin toplamını, min, max ve ortalamasını bulunuz.

In [19]:
df.groupby("time")["total_bill"].agg(["min","max", "mean"])

         min    max       mean
time
Lunch   7.51  43.11  17.168676
Dinner  3.07  50.81  20.797159

Görev 19: Günlere ve time göre total_bill değerlerinin toplamını, min, max ve ortalamasını bulunuz.

In [20]:
df.groupby(["day","time"])["total_bill"].agg(["sum","min","max", "mean"])

                 sum    min    max       mean
day  time
Thur Lunch   1077.55   7.51  43.11  17.664754
     Dinner    18.78  18.78  18.78  18.780000
Fri  Lunch     89.92   8.58  16.27  12.845714
     Dinner   235.96   5.75  40.17  19.663333
Sat  Lunch      0.00    NaN    NaN        NaN
     Dinner  1778.40   3.07  50.81  20.441379
Sun  Lunch      0.00    NaN    NaN        NaN
     Dinner  1627.16   7.25  48.17  21.410000

Görev 20: Lunch zamanına ve kadın müşterilere ait total_bill ve tip değerlerinin day'e göre toplamını, min, max ve ortalamasını bulunuz.

In [21]:
df[(df["time"] == "Lunch") & (df["sex"] == "Female")].groupby("day").agg({"total_bill":["min","max","sum","mean"],"tip" : ["min","max","sum","mean"]})

     total_bill                            tip
            min    max     sum      mean   min   max    sum      mean
day
Thur       8.35  43.11  516.11  16.64871  1.25  5.17  79.42  2.561935
Fri       10.09  16.27   55.76  13.94000  2.00  3.48  10.98  2.745000
Sat         NaN    NaN    0.00       NaN   NaN   NaN   0.00       NaN
Sun         NaN    NaN    0.00       NaN   NaN   NaN   0.00       NaN

In [27]:
filtered_df = df[(df["time"] == "Lunch") & (df["sex"] == "Female")]
pivot_table_result = filtered_df.pivot_table(
    values=["total_bill", "tip"],
    index="day",
    aggfunc=["min", "max", "sum", "mean"],
    fill_value=0
)
pivot_table_result

       min              max               sum                 mean
       tip total_bill   tip total_bill    tip total_bill       tip total_bill
day
Thur  1.25       8.35  5.17      43.11  79.42     516.11  2.561935   16.64871
Fri   2.00      10.09  3.48      16.27  10.98      55.76  2.745000   13.94000
Sat    NaN        NaN   NaN        NaN   0.00       0.00       NaN        NaN
Sun    NaN        NaN   NaN        NaN   0.00       0.00       NaN        NaN

Görev 21: size'i 3'ten küçük, total_bill'i 10'dan büyük olan siparişlerin total_bill değerlerinin ortalaması nedir? (loc kullanınız)

In [24]:
df.loc[(df["size"]< 3) & (df["total_bill"] > 10), "total_bill"].mean()

17.184965034965035

Görev 22: total_bill_tip_sum adında yeni bir değişken oluşturunuz. Her bir müşterinin ödediği totalbill ve tip in toplamını versin.

In [25]:
df["total_bill_tip_sum"] = df["total_bill"] + df["tip"]

Görev 23: total_bill_tip_sum değişkenine göre büyükten küçüğe sıralayınız ve ilk 30 kişiyi yeni bir dataframe'e atayınız

In [26]:
new_df = df.sort_values("total_bill_tip_sum" , ascending=False , ignore_index=True).head(30)